var you,  HP, maxHP,  mana,  dam, maxdam, vanpirrizm, magshitr, twodam, opet, yroven:integer;

 name, racca, klass: string;
 
 begin
  
 writeln( 'Bыбери имя' );
 name:=readln();
 
 writeln( 'Выбери рассу люди, орки, эльфы. Люди хорошы во всем по немногу им в древние времена эльфы подарили бесконечный источник эл. жизни, и каждый житель имеет доп. элексира жизни. Орки могучие кузнецы исделали себе самую прочную броню, но хуже колдуют. Эльфы менее живучие , но никто несравниться с ними в колдовстве');
 racca:=readln();
 
 writeln( 'Выбери касту: воин, ассасин, маг. Воины от рождения сильнее и имеют большой вампиризм. Ассины ловкие и имеют больший двойной удрар. Маги кастуют более крепкие магичиские щиты и проводят больше времени в чаровальне и сварили 2 доп. элексира маны ')
 klass:=readln();
 
 maxdam:=40;
 dam:=random(maxdam);
 if dam=maxdan/2 then dam:=maxdam/2;
 dam:=random(maxdam);
 
 maxHP:=200:
 hp
 
 

end.